{
  "module": "keras.src.models.functional",
  "class_name": "Functional",
  "config": {
    "name": "functional_16",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, 256, 256, 3],
          "dtype": "float32",
          "sparse": false,
          "name": "input_layer"
        },
        "registered_name": null,
        "name": "input_layer",
        "inbound_nodes": []
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 256, 256, 3],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_1"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 256, 256, 3]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 128, 128, 64]
              }
            }
          ],
          "build_input_shape": [null, 256, 256, 3]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 256, 256, 3]
        },
        "name": "sequential",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 256, 256, 3],
                  "dtype": "float32",
                  "keras_history": [
                    "input_layer",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_1",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 128, 128, 64],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_2"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 128,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 128, 128, 64]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 64, 64, 128]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu_1",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 64, 64, 128]
              }
            }
          ],
          "build_input_shape": [null, 128, 128, 64]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 128, 128, 64]
        },
        "name": "sequential_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 128, 128, 64],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_2",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 64, 64, 128],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_3"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_2",
                "trainable": true,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 64, 64, 128]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_1",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 32, 32, 256]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu_2",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 32, 32, 256]
              }
            }
          ],
          "build_input_shape": [null, 64, 64, 128]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 64, 64, 128]
        },
        "name": "sequential_2",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 64, 64, 128],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential_1",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_3",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 32, 32, 256],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_4"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_3",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 32, 32, 256]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_2",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 16, 16, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu_3",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 16, 16, 512]
              }
            }
          ],
          "build_input_shape": [null, 32, 32, 256]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 32, 32, 256]
        },
        "name": "sequential_3",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 32, 32, 256],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential_2",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_4",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 16, 16, 512],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_5"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_4",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 16, 16, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_3",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 8, 8, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu_4",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 8, 8, 512]
              }
            }
          ],
          "build_input_shape": [null, 16, 16, 512]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 16, 16, 512]
        },
        "name": "sequential_4",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 16, 16, 512],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential_3",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_5",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 8, 8, 512],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_6"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_5",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 8, 8, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_4",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 4, 4, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu_5",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 4, 4, 512]
              }
            }
          ],
          "build_input_shape": [null, 8, 8, 512]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 8, 8, 512]
        },
        "name": "sequential_5",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 8, 8, 512],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential_4",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_6",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 4, 4, 512],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_7"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_6",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 4, 4, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_5",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 2, 2, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu_6",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 2, 2, 512]
              }
            }
          ],
          "build_input_shape": [null, 4, 4, 512]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 4, 4, 512]
        },
        "name": "sequential_6",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 4, 4, 512],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential_5",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_7",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 2, 2, 512],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_8"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_7",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 2, 2, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_6",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 1, 1, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "LeakyReLU",
              "config": {
                "name": "leaky_re_lu_7",
                "trainable": true,
                "dtype": "float32",
                "negative_slope": 0.3
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 1, 1, 512]
              }
            }
          ],
          "build_input_shape": [null, 2, 2, 512]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 2, 2, 512]
        },
        "name": "sequential_7",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 2, 2, 512],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential_6",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_8",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 1, 1, 512],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_9"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2DTranspose",
              "config": {
                "name": "conv2d_transpose",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 1, 1, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_7",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 2, 2, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "seed": null,
                "noise_shape": null
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "ReLU",
              "config": {
                "name": "re_lu",
                "trainable": true,
                "dtype": "float32",
                "max_value": null,
                "negative_slope": 0,
                "threshold": 0
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 2, 2, 512]
              }
            }
          ],
          "build_input_shape": [null, 1, 1, 512]
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [null, 1, 1, 512]
        },
        "name": "sequential_8",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 1, 1, 512],
                  "dtype": "float32",
                  "keras_history": [
                    "sequential_7",
                    0, 0]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate",
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [null, 2, 2, 512],
            [null, 2, 2, 512]
          ]
        },
        "name": "concatenate",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 2, 2, 512],
                    "dtype": "float32",
                    "keras_history": [
                      "sequential_8",
                      0, 0]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 2, 2, 512],
                    "dtype": "float32",
                    "keras_history": [
                      "sequential_6",
                      0, 0]
                  }
                }
              ]
            ],
            "kwargs": {

            }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "sequential_9",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 2, 2, 1024],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_10"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2DTranspose",
              "config": {
                "name": "conv2d_transpose_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [4, 4],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "RandomNormal",
                  "config": {
                    "mean": 0,
                    "stddev": 0.02,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 2, 2, 1024]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_8",
                "trainable": true,
                "dtype": "float32",
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {

                  },
                  "registered_name": null
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {

                  },
                  "registered_name": null
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 4, 4, 512]
              }
            },
            {
              "module": "keras.layers",
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "seed": null,
                "noise_shape": null
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "ReLU",
              "config": {
                "name": "re_lu_1",
                "trainable": true,
                "dtype": "float32",
                "max_value": null,
